app/Controllers/Livro.php

SELECT *
FROM `tb_livro`
---
    public function index()
    {
        $livroModel = new \App\Models\LivroModel();
        $data['livros'] = $livroModel->findAll();

SELECT *
FROM `tb_livro`
WHERE `tb_livro`.`id` = '2'
---
    public function returnUnique($id){
        $livroModel = new \App\Models\LivroModel();
        $data['livros'] = $livroModel->find($id);

SELECT *
FROM `tb_livro`
 LIMIT 2
---
    public function returnWithMax($max){
        $livroModel = new \App\Models\LivroModel();
        $data['livros'] = $livroModel->findAll($max);

SELECT *
FROM `tb_livro`
WHERE `token` = '3'
AND `tb_livro`.`id` = '1'
---
    public function returnToken($id, $token){
        $livroModel = new \App\Models\LivroModel();
        $livro = $livroModel->where('token', $token)->find($id);

DELETE FROM `tb_livro`
WHERE `id` IN ('1')
---
    public function excluir($id){
        $livroModel = new \App\Models\LivroModel();
        if($this->request->getMethod() == 'delete'){
            if($livroModel->delete($id)){