app/Models/LivroModel.php

        public function postInserir($livro_data){
            if($this->insert($livro_data)){
---
INSERT INTO `tb_livro` (`nome`, `descricao`, `autor`) VALUES ('a', 'a', 'a')